


coolan_emoji = ['[哈哈哈]','[可爱]','[呵呵]','[爆怒]','[托腮]','[吐舌]','[喷血]','[笑眼]','[捂嘴笑]','[笑哭]','[ok]','[我最美]','[黑线]','[喷]','[喝酒]','[噗]','[微微一笑]','[欢呼]','[耐克嘴]','[t耐克嘴]','[无奈]','[qqdoge]','[舒服]','[懒得理]','[不开心]','[挑眉坏笑]','[害怕]','[哼唧]','[挨打]','[假笑]','[偷看]','[喝茶]','[哦吼吼]','[掩面笑]','[表面哭泣]','[表面开心]','[滑稽]','[流汗滑稽]','[受虐滑稽]','[cos滑稽]','[斗鸡眼滑稽]','[墨镜滑稽]','[小嘴滑稽]','[针不戳]','[列文虎克]','[真正的音乐]','[感知不强]','[给我整一个]','[yyds]','[doge]','[doge笑哭]','[doge呵斥]','[doge原谅ta]','[喵喵]','[二哈]','[二哈盯]','[牛啤]','[py交易]','[绿药丸]','[红药丸]','[酷安]','[酷安钓鱼]','[绿帽]','[酷安绿帽]','[火把]','[夏阁艾迪剑]','[下次一定]','[酷安土豆]','[头条通知书]','[酷币]','[酷币1分]','[酷币2分]','[酷币5分]','[酷币1毛]','[酷币5毛]','[酷币2毛]','[酷币1块]','[酷币2块]','[酷币5块]','[酷币10块]','[酷币20块]','[酷币50块]','[酷币100块]','[酷币2$]','[酷币1$]','[酷币1€]','[酷币5€]','[酷币5€]','[酷币2€]','[酷币5$]']


#todo 有空在补充对应的表情
switcher = {
    "[哈哈哈]": 'sunday',
    '[可爱]': 'Monday',
    2: 'Tuesday'
}

def emoji_relace(text):
    # 使用正则表达式进行匹配和替换
    for emoji in coolan_emoji:
        if emoji in text:
            text = text.replace(emoji,"[哇]")
            break
    return text
  
# text = "[绿帽]1111111"
# # 使用正则表达式进行匹配和替换
# for emoji in coolan_emoji:
#     if emoji in text:
#         # text = text.replace(emoji,switcher[emoji])
#         #暂时全部更换为[哇]
#         text = text.replace(emoji,"[哇]")
#         break
# print(text)